InformationRegisters/ЖурналСтатусовФинОтчетностиВБанки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСтатусовФинОтчетностиВБанки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиФинОтчетностиВБанки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СправочникБанкиФинОтчетность</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиПредмета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКритическиеОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Непрочтенное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСдачиОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументооборотаОбменаСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметОбменаСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ФинОтчетВБанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ФинОтчетВБанк</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭкономическиеСубъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключатьОбособленныеПодразделения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отчетность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиОтчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиКомплекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлОтчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УточнениеНаименования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлОтчетаСодержитЭП</Name>
							<Comment>Истина, если ФайлОтчета содержит ссылку на присоединный zip-архив, внутри которого есть в том числе файлы электронных подписей</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияДанныхОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнаяКорректировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиОтчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиСистемыНалогообложения</Name>
					<Comment>Заполняются при загрузке пакетов отчетности других компаний группы, которые ведут учет в собственных базах 1С:Бухгалтерии</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемаНалогообложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНДоходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНДоходыМинусРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНПатент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикТорговогоСбора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяНалогНаПрофессиональныйДоход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЖурналСтатусовФинОтчетностиВБанки/Forms/ФормаСозданияНовогоОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация   = Параметры.Организация;
	Банк          = Параметры.Банк;
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода  = Параметры.КонецПериода;
	
	// Ограничим список выбираемых организаций только теми, данных которых пользователь может просматривать.
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю();
	ПараметрыВыбораОрганизации = Новый Массив();
	ПараметрыВыбораОрганизации.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеОрганизации));
	Элементы.Организация.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизации);
	
	ОргПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Если ДоступныеОрганизации.Найти(ОргПоУмолчанию) = Неопределено Тогда
		ОргПоУмолчанию = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ОргПоУмолчанию) Тогда
		Организация = ОргПоУмолчанию;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Организация = ОргПоУмолчанию;
		Элементы.НадписьОрганизация.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокБанков();
	
	ОбновитьКомплектыОтчетности();
	
	УправлениеФормой(ЭтотОбъект);
	
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	
	Если Периодичность = "Квартал" Тогда
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоКвартала(КонецПериода), КонецКвартала(КонецПериода));
		ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаКвартал", ПараметрыВыбора, ЭтотОбъект,,,, ОписаниеОповещения);
	Иначе
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(КонецПериода), КонецМесяца(КонецПериода));
		ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	
	ИзменитьПериод(ЭтотОбъект, -ШагПериода());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийПериод(Команда)
	
	ИзменитьПериод(ЭтотОбъект, ШагПериода());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
	
	// Показывает в виде предупреждений, а не простых сообщений пользователя,
	// т.к. форма небольшая по размеру и сообщения внизу занимают почти половину от самой формы.
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , , НСтр("ru = 'Организация'"));
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , , НСтр("ru = 'Получатель'"));
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторКомплекта) Тогда
		Если Элементы.НесколькоКомплектов.СписокВыбора.Количество() > 0 Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения( , , НСтр("ru = 'Наименование'"));
		Иначе
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Отсутствуют доступные отчеты для %1'"),
				Банк);
		КонецЕсли;

		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(ДатаОкончанияДействияКомплекта) И КонецПериода > ДатаОкончанияДействияКомплекта)
		Или (ЗначениеЗаполнено(ДатаНачалаДействияКомплекта) И НачалоПериода < ДатаНачалаДействияКомплекта) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "КОРРЕКТНОСТЬ", НСтр("ru = 'Период'"));
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ФинОтчетностьВБанкиКлиентСервер.ЭтоБанкУниверсальногоОбмена(Банк) Тогда
	
		// Для работы с электронными подписями у присоединенных файлов включим соответствующую опцию БСП.
		ПроверитьВключитьОпциюИспользоватьЭлектронныеПодписи();
	
		// Создаем пакет отчетов для сервиса 1С:ФинОтчетность в банки.
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("Организация",                   Организация);
		ЗначенияЗаполнения.Вставить("Банк",                          Банк);
		ЗначенияЗаполнения.Вставить("НачалоПериода",                 НачалоПериода);
		ЗначенияЗаполнения.Вставить("КонецПериода",                  КонецМесяца(КонецПериода));
		ЗначенияЗаполнения.Вставить("ИдентификаторКомплекта",        ИдентификаторКомплекта);
		ЗначенияЗаполнения.Вставить("КраткоеПредставлениеКомплекта", КраткоеПредставлениеКомплекта);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.ФинОтчетВБанк.Форма.ФормаДокумента", ПараметрыФормы, , Истина);
	
	Иначе
		// Создаем отчет БРО БухгалтерскаяОтчетностьВБанк.
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ПараметрыКлиента = Новый Структура;
		ПараметрыКлиента.Вставить("ТипПлатформы", Строка(СистемнаяИнформация.ТипПлатформы));
		ПараметрыКлиента.Вставить("ВерсияОС",     СистемнаяИнформация.ВерсияОС);

		ВозможнаОтправка = ОтчетностьВБанкиСлужебныйВызовСервера.ВозможнаОтправкаОтчета(Организация, Банк, ПараметрыКлиента);
		
		Если НЕ ВозможнаОтправка Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", НачалоПериода);
		ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  КонецМесяца(КонецПериода));
		ПараметрыФормы.Вставить("Организация",              Организация);
		ПараметрыФормы.Вставить("мВыбраннаяФорма",          ИдентификаторКомплекта);
		ПараметрыФормы.Вставить("Банк",                     Банк);
		
		ОткрытьФорму("Отчет.БухгалтерскаяОтчетностьВБанк.Форма." + ИдентификаторКомплекта, ПараметрыФормы, , Истина);
		
	КонецЕсли;
	
	// Текущую форму закрываем.
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ОбновитьКомплектыОтчетности();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКомплектаПриИзменении(Элемент)
	
	ИдентификаторКомплектаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункци

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ПериодОтчета.КнопкаВыбора = Форма.Периодичность <> "Год";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодПоУмолчанию()
	
	ТекущаяДата = ОбщегоНазначенияБП.ТекущаяДатаНаСервере();
	ЭтоПервыйКвартал = НачалоКвартала(ТекущаяДата) = НачалоГода(ТекущаяДата);
	
	Если Периодичность = "Год" Тогда
		КонецПериода = ПредыдущийГод(ТекущаяДата);
		Если ЭтоПервыйКвартал И ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод Тогда
			КонецПериода = ПредыдущийГод(КонецПериода);
		КонецЕсли;
	ИначеЕсли Периодичность = "Квартал" Тогда
		КонецПериода = ПредыдущийКвартал(ТекущаяДата);
		Если ЭтоПервыйКвартал И ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод Тогда
			КонецПериода = ПредыдущийКвартал(КонецПериода);
		КонецЕсли;
	Иначе
		КонецПериода  = ПредыдущийМесяц(ТекущаяДата);
		Если ЭтоПервыйКвартал И ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод Тогда
			КонецПериода = ПредыдущийМесяц(КонецПериода);
		КонецЕсли;
	КонецЕсли;
	
	ИзменитьПериод(ЭтотОбъект, 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийМесяц(Дата)
	
	Возврат КонецМесяца(НачалоМесяца(Дата) - 1);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийКвартал(Дата)
	
	Возврат КонецКвартала(НачалоКвартала(Дата) - 1);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийГод(Дата)
	
	Возврат КонецГода(НачалоГода(Дата) - 1);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПериод(Форма, Шаг)
	
	Форма.КонецПериода  = КонецМесяца(ДобавитьМесяц(Форма.КонецПериода, Шаг));
	Форма.НачалоПериода = НачалоГода(Форма.КонецПериода);
	
	Форма.ПериодОтчета = ЗаполнениеФинОтчетностиВБанкиКлиентСервер.ПредставлениеПериодаОтчета(
		Форма.НачалоПериода, Форма.КонецПериода, Форма.Периодичность);
	
	// Проверка применимости отчета в указанном периоде
	Если (ЗначениеЗаполнено(Форма.ДатаОкончанияДействияКомплекта) И Форма.КонецПериода > Форма.ДатаОкончанияДействияКомплекта)
		Или (ЗначениеЗаполнено(Форма.ДатаНачалаДействияКомплекта) И Форма.НачалоПериода < Форма.ДатаНачалаДействияКомплекта) Тогда
		Если НачалоДня(Форма.ДатаОкончанияДействияКомплекта) = КонецВремен() Тогда
			Форма.Элементы.ПериодОтчета.РасширеннаяПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'Период действия: с %1'"),
				Формат(Форма.ДатаНачалаДействияКомплекта, "ДФ=dd.MM.yyyy"));
		Иначе
			Форма.Элементы.ПериодОтчета.РасширеннаяПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'Период действия: %1-%2'"),
				Формат(Форма.ДатаНачалаДействияКомплекта, "ДФ=dd.MM.yyyy"), Формат(Форма.ДатаОкончанияДействияКомплекта, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	Иначе
		Форма.Элементы.ПериодОтчета.РасширеннаяПодсказка.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КонецВремен()
	
	Возврат Дата(2999, 12, 31);
	
КонецФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоГода(РезультатВыбора.НачалоПериода);
	КонецПериода  = РезультатВыбора.КонецПериода;
	
	ИзменитьПериод(ЭтотОбъект, 0);
	
КонецПроцедуры

&НаКлиенте
Функция ШагПериода()
	
	Если Периодичность = "Год" Тогда
		Возврат 12;
	ИначеЕсли Периодичность = "Квартал" Тогда
		Возврат 3;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокБанков()

	СписокВыбора = Элементы.Банк.СписокВыбора;
	СписокВыбора.Очистить();
	
	ДоступныеБанки = ФинОтчетностьВБанки.ДоступныеБанки(Ложь);
	
	Для каждого ЭлементСписка Из ДоступныеБанки Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКомплектыОтчетности()
	
	СписокВыбора = Элементы.НесколькоКомплектов.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Банк) Тогда
		// Проверим, были ли ранее считаны данные о требованиях банка к отчетности.
		Отбор = Новый Структура();
		Отбор.Вставить("Банк", Банк);
		
		НайденныеСтроки = КомплектыОтчетности.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если ФинОтчетностьВБанкиКлиентСервер.ЭтоБанкУниверсальногоОбмена(Банк) Тогда
				
				// Ранее не получали по выбранному банку комплекты отчетности, получаем их сейчас.
				КомплектыОтчетностиБанка = ЗаполнениеФинОтчетностиВБанки.КомплектыОтчетности(Банк);
				Для каждого СтрокаКомплекта Из КомплектыОтчетностиБанка Цикл
					Если СтрокаКомплекта.Архивный Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = КомплектыОтчетности.Добавить();
					НоваяСтрока.Банк = Банк;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКомплекта);
					
					НайденныеСтроки.Добавить(НоваяСтрока);
				КонецЦикла;
				
			Иначе
				// Задаем настройки по умолчанию для актуальной формы отчета БРО БухгалтерскаяОтчетностьВБанк.
				НоваяСтрока = КомплектыОтчетности.Добавить();
				НоваяСтрока.Банк                   = Банк;
				НоваяСтрока.Идентификатор          = "ФормаОтчета2017Кв3";
				 // Всегда используем фиксированное значение.
				НоваяСтрока.КраткоеПредставление   = ФинОтчетностьВБанки.НаименованиеОтчетностиВСбербанк();
				НоваяСтрока.ПодробноеПредставление = "";
				НоваяСтрока.ДатаНачала             = '0001-01-01';
				НоваяСтрока.ДатаОкончания          = '2999-12-31';
				
				НайденныеСтроки.Добавить(НоваяСтрока);
			КонецЕсли;
		КонецЕсли;
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СписокВыбора.Добавить(НайденнаяСтрока.Идентификатор, НайденнаяСтрока.КраткоеПредставление);
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокВыбора.Количество() > 1 Тогда
		Элементы.НесколькоКомплектов.Видимость = Истина;
		Элементы.ОдинКомплект.Видимость        = Ложь;
	Иначе
		Элементы.НесколькоКомплектов.Видимость = Ложь;
		Элементы.ОдинКомплект.Видимость        = Истина;
		
		Если СписокВыбора.Количество() > 0 Тогда
			ИдентификаторКомплекта        = СписокВыбора[0].Значение;
			КраткоеПредставлениеКомплекта = СписокВыбора[0].Представление;
		Иначе
			ИдентификаторКомплекта        = "";
			КраткоеПредставлениеКомплекта = "";
		КонецЕсли;
		ЗаполнитьДанныеКомплекта(ИдентификаторКомплекта);
	КонецЕсли;
	
	УстановитьПериодПоУмолчанию();
	
	ОбновитьПодсказкуНазначения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКомплекта(Идентификатор)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Идентификатор", Идентификатор);
	
	НайденныеСтроки = КомплектыОтчетности.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока =  НайденныеСтроки[0];
		Периодичность = НайденнаяСтрока.Периодичность;
		ДатаНачалаДействияКомплекта = НайденнаяСтрока.ДатаНачала;
		ДатаОкончанияДействияКомплекта = НайденнаяСтрока.ДатаОкончания;
		ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод = НайденнаяСтрока.ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод;
	Иначе
		Периодичность = Неопределено;
		ДатаНачалаДействияКомплекта = Неопределено;
		ДатаОкончанияДействияКомплекта = Неопределено;
		ПодставлятьПоУмолчаниюПредпоследнийЗакрытыйПериод = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуНазначения(Форма)

	Элементы = Форма.Элементы;
	ЭлементСПодсказкой = Элементы.ГруппаУправлениеПериодом;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Банк",          Форма.Банк);
	Отбор.Вставить("Идентификатор", Форма.ИдентификаторКомплекта);
	
	НайденныеСтроки = Форма.КомплектыОтчетности.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЭлементСПодсказкой.Подсказка = НайденныеСтроки[0].ПодробноеПредставление;
	Иначе
		ЭлементСПодсказкой.Подсказка = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьВключитьОпциюИспользоватьЭлектронныеПодписи()

	Если ЭлектроннаяПодпись.ИспользоватьЭлектронныеПодписи() Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Константы.ИспользоватьЭлектронныеПодписи.Установить(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

&НаСервере
Процедура ИдентификаторКомплектаПриИзмененииНаСервере()
	
	ЗаполнитьДанныеКомплекта(ИдентификаторКомплекта);
	
	УстановитьПериодПоУмолчанию();
	
	ОбновитьПодсказкуНазначения(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
